
struct Head
  ℓₑ
  ℓ₀
  ⌀₀
  ℎ₀
  ℓᵣ
  ⌀ᵣ
  ℎᵣ
  ℓₚ
  𝜃ₚ
  ⌀ₑ
  ℎₑ
  𝑑ₑ
  𝑠ₑ
  𝜓ₑ
  𝜙ₑ
  ℓₛ
  ⌀ₛ
  ℎₛ
  ℓₙ
  ℓₐ
end

function createHead(;ℓₑ=52.0,ℓ₀=32.0,⌀₀=19.0,ℎ₀=2.5,ℓᵣ=17.0,⌀ᵣ=17.0,ℎᵣ=3.5,ℓₚ=24.0,𝜃ₚ=22.6,⌀ₑ=17.4,ℎₑ=4.3,𝑑ₑ=10.0,𝑠ₑ=12.0,𝜓ₑ=7.0,𝜙ₑ=0.0,ℓₛ=120.0,⌀ₛ=19.0,ℎₛ=2.5,ℓₙ=126.0,ℓₐ=156.0)
  return new head(ℓₑ,ℓ₀,⌀₀,ℎ₀,ℓᵣ,⌀ᵣ,ℎᵣ,ℓₚ,𝜃ₚ,⌀ₑ,ℎₑ,𝑑ₑ,𝑠ₑ,𝜓ₑ,𝜙ₑ,ℓₛ,⌀ₛ,ℎₛ,ℓₙ,ℓₐ)
end

struct ToneHole
  𝑓ₕ
  ℓₕ
  ⌀ₕ
  ℎₕ
  𝑑ₕ
  𝜃ₕ
end

struct Flute
  head::Head
  toneholes::Vector<ToneHole>
  𝑓ₜ
  ℓₜ
  ⌀ₜ
  ℎₜ
end

