
export 𝐺
export A₀,A♯₀,B♭₀,B₀,C₁,C♯₁,D♭₁,D₁,D♯₁,E♭₁,E₁,F₁,F♯₁,G♭₁,G₁,G♯₁,A♭₁
export A₁,A♯₁,B♭₁,B₁,C₂,C♯₂,D♭₂,D₂,D♯₂,E♭₂,E₂,F₂,F♯₂,G♭₂,G₂,G♯₂,A♭₂
export A₂,A♯₂,B♭₂,B₂,C₃,C♯₃,D♭₃,D₃,D♯₃,E♭₃,E₃,F₃,F♯₃,G♭₃,G₃,G♯₃,A♭₃
export A₃,A♯₃,B♭₃,B₃,C₄,C♯₄,D♭₄,D₄,D♯₄,E♭₄,E₄,F₄,F♯₄,G♭₄,G₄,G♯₄,A♭₄
export A₄,A♯₄,B♭₄,B₄,C₅,C♯₅,D♭₅,D₅,D♯₅,E♭₅,E₅,F₅,F♯₅,G♭₅,G₅,G♯₅,A♭₅
export A₅,A♯₅,B♭₅,B₅,C₆,C♯₆,D♭₆,D₆,D♯₆,E♭₆,E₆,F₆,F♯₆,G♭₆,G₆,G♯₆,A♭₆
export A₆,A♯₆,B♭₆,B₆,C₇,C♯₇,D♭₇,D₇,D♯₇,E♭₇,E₇,F₇,F♯₇,G♭₇,G₇,G♯₇,A♭₇
export A₇,A♯₇,B♭₇,B₇,C₈,C♯₈,D♭₈,D₈,D♯₈,E♭₈,E₈,F₈,F♯₈,G♭₈,G₈,G♯₈,A♭₈
𝐺 =2^(1/12)
A₀=27.50
A♯₀=B♭₀=A₀*𝐺
B₀=A₀*𝐺^2
C₁=A₀*𝐺^3
C♯₁=D♭₁=A₀*𝐺^4
D₁=A₀*𝐺^5
D♯₁=E♭₁=A₀*𝐺^6
E₁=A₀*𝐺^7
F₁=A₀*𝐺^8
F♯₁=G♭₁=A₀*𝐺^9
G₁=A₀*𝐺^10
G♯₁=A♭₁=A₀*𝐺^11
A₁=A₀*2
A♯₁=B♭₁=A₁*𝐺
B₁=A₁*𝐺^2
C₂=A₁*𝐺^3
C♯₂=D♭₂=A₁*𝐺^4
D₂=A₁*𝐺^5
D♯₂=E♭₂=A₁*𝐺^6
E₂=A₁*𝐺^7
F₂=A₁*𝐺^8
F♯₂=G♭₂=A₁*𝐺^9
G₂=A₁*𝐺^10
G♯₂=A♭₂=A₁*𝐺^11
A₂=A₁*2
A♯₂=B♭₂=A₂*𝐺
B₂=A₂*𝐺^2
C₃=A₂*𝐺^3
C♯₃=D♭₃=A₂*𝐺^4
D₃=A₂*𝐺^5
D♯₃=E♭₃=A₂*𝐺^6
E₃=A₂*𝐺^7
F₃=A₂*𝐺^8
F♯₃=G♭₃=A₂*𝐺^9
G₃=A₂*𝐺^10
G♯₃=A♭₃=A₂*𝐺^11
A₃=A₂*2
A♯₃=B♭₃=A₃*𝐺
B₃=A₃*𝐺^2
C₄=A₃*𝐺^3
C♯₄=D♭₄=A₃*𝐺^4
D₄=A₃*𝐺^5
D♯₄=E♭₄=A₃*𝐺^6
E₄=A₃*𝐺^7
F₄=A₃*𝐺^8
F♯₄=G♭₄=A₃*𝐺^9
G₄=A₃*𝐺^10
G♯₄=A♭₄=A₃*𝐺^11
A₄=A₃*2
A♯₄=B♭₄=A₄*𝐺
B₄=A₄*𝐺^2
C₅=A₄*𝐺^3
C♯₅=D♭₅=A₄*𝐺^4
D₅=A₄*𝐺^5
D♯₅=E♭₅=A₄*𝐺^6
E₅=A₄*𝐺^7
F₅=A₄*𝐺^8
F♯₅=G♭₅=A₄*𝐺^9
G₅=A₄*𝐺^10
G♯₅=A♭₅=A₄*𝐺^11
A₅=A₄*2
A♯₅=B♭₅=A₅*𝐺
B₅=A₅*𝐺^2
C₆=A₅*𝐺^3
C♯₆=D♭₆=A₅*𝐺^4
D₆=A₅*𝐺^5
D♯₆=E♭₆=A₅*𝐺^6
E₆=A₅*𝐺^7
F₆=A₅*𝐺^8
F♯₆=G♭₆=A₅*𝐺^9
G₆=A₅*𝐺^10
G♯₆=A♭₆=A₅*𝐺^11
A₆=A₅*2
A♯₆=B♭₆=A₆*𝐺
B₆=A₆*𝐺^2
C₇=A₆*𝐺^3
C♯₇=D♭₇=A₆*𝐺^4
D₇=A₆*𝐺^5
D♯₇=E♭₇=A₆*𝐺^6
E₇=A₆*𝐺^7
F₇=A₆*𝐺^8
F♯₇=G♭₇=A₆*𝐺^9
G₇=A₆*𝐺^10
G♯₇=A♭₇=A₆*𝐺^11
A₇=A₆*2
A♯₇=B♭₇=A₇*𝐺
B₇=A₇*𝐺^2
C₈=A₇*𝐺^3
C♯₈=D♭₈=A₇*𝐺^4
D₈=A₇*𝐺^5
D♯₈=E♭₈=A₇*𝐺^6
E₈=A₇*𝐺^7
F₈=A₇*𝐺^8
F♯₈=G♭₈=A₇*𝐺^9
G₈=A₇*𝐺^10
G♯₈=A♭₈=A₇*𝐺^11

